/*
Τι θα μάθουμε:
- Θα μάθουμε πιο αναλυτικά το πακέτο fmt
- Ποια η διαφορά του fmt.Println απο fmt.Printf και fmt.Sprintf
- Πότε χρησιμοποιούμε το ένα πότε το άλλο

*/

package main

/*
 Το πακέτο fmt που χρησιμοποιούμε τοσο συχνά,
 υλοποιεί μορφοποίηση εισόδου/εξόδου με μεθόδους
 ανάλογους με το printf και το scanf της γλώσσας C
*/
//
import "fmt"

func main() {

	/*  fmt.Println()

	Το fmt.Pritln() χρησιμοποιείται για να εμφανίζουμε
	μηνύματα και αποτελέσματα.
	Τα διαστήματα προστίθενται πάντα μεταξύ των τελεστών
	ενώ στο τέλος προσαρτάται πάντα μια νέα γραμμή
	χωρίς να χρειάζεται να προσθέσετε "\n".
	*/
	fmt.Println("Γεια σου Κόσμο της Go!")

	/*  fmt.Printf()

	Το fmt.Printf() χρησιμοποιείται επίσης για να εμφανίζουμε
	μηνύματα και αποτελέσματα αλλά σε συγκεκριμένη μορφοποίηση
	την οποία επιθυμούμε. Η μορφοποίηση δηλώνεται με %n, όπου 'n'
	όπως θα δούμε παρακάτω, είναι ένα προκαθορισμένο απο την Go γράμμα.

	Σε αντίθεση με την Println(), η Printf() δεν προσθέτει αυτόματα
	νέα γραμμή στο τέλος, οπότε αν το χρειάζεστε, μπορείτε να το δηλώσετε
	με \n.

	*/

	/*
		Τελεστές:
		%d -> δεκαδικό
		%f -> κινητής υποδιαστολής
		%s -> λέξη (συμβολοσειρά)
		%q -> λέξη εντός " "
		%v -> τιμή (οποιαδήποτε)
		%#v -> εμφανίζει την σύνταξη της Go που αναπαριστάνει την τιμή
		%T -> Τύπος της τιμής (π.χ. να εμφανίζει αν είναι int,float κλπ)
		%t -> Λογικός τελεστής (true ή false)
		%p -> δείκτης (διεύθυνση σε base 16, που ξεκινάει με 0x)
		%c -> char (rune) αντιπροσωπεύεται από το αντίστοιχο Unicode κώδικα
	*/

	a, b, c := 10, 15.5, "Μια λέξη"
	grades := []int{10, 20, 30}

	fmt.Printf("το a είναι %d, το b είναι %f, το c είναι %s \n", a, b, c)
	// => a είναι 10, b είναι 15.500000, c είναι Μια λέξη
	fmt.Printf("%q\n", c)       // => "Μια λέξη"
	fmt.Printf("%v\n", grades)  // => [10 20 30]
	fmt.Printf("%#v\n", grades) // => []int{10, 20, 30}
	fmt.Printf("%q", c)         // => βάζει την τιμή της c ανάμεσα σε " "
	fmt.Printf("το b είναι type %T και το grades είναι type %T\n", b, grades)
	// => το b είναι type float64 και το grades είναι type []int
	fmt.Printf("Η διεύθυνση του δείκτη &a είναι: %p\n", &a)
	fmt.Printf("%c και %c\n", 100, 51011) // =>  runes για code points του 101 και 51011

	const pi float64 = 3.14159265359
	fmt.Printf("pi is %.3f\n", pi) // => μορφοποίηση για εμφάνιση με 3 δεκαδικά ψηφία

	fmt.Printf("255 σε base 2 είναι %b\n", 255)
	fmt.Printf("101 σε base 16 είναι %x\n", 101)

	// To fmt.Sprintf() μετατρέπει και επιστρέφει λέξεις. Χρησιμοποιεί
	// τους ίδιους τελεστές με την fmt.Printf()
	s := fmt.Sprintf("το a είναι %d, το b είναι %f, το c είναι %s \n", a, b, c)
	fmt.Println(s)

}
