package main

import (
	"fmt"
	"io/ioutil"
	"log"
	"os"
)

func main() {
	// FILE I/O
	/*
		Η πρότυπη βιβλιοθήκη "io" της Go περιλαμβάνει πολλές υλοποιήσεις των διεπαφών διαχείρισης
		αρχείων για εισαγωγή και εγγραφή δεδομένων, συνδέσεων δικτύου, συμπιεστών, κρυπτογράφησης και άλλων.
	*/

	// == Πρώτη μέθοδος ανοίγματος αρχείου ==
	// Με την os.* συνηθίζεται να ανοίγουμε αρχεία
	// με λίγα δεδομένα

	// Δημιουργούμε ένα αρχείο με όνομα samp.txt στην διαδρομή απο όπου εκτελείται η εφαρμογή
	// π.χ. αν τρέξουμε την εφαρμογή <<go run enas-fakelos/kodikas.go>> τότε το αρχείο θα δημιουργηθεί δίπλα απο τον φάκελο
	// "enas-fakelos" και όχι μέσα στον φάκελο δίπλα απο το "kodikas.go"
	file, err := os.Create("samp.txt")
	if err != nil { // Πρόβαλε τυχόν σφάλματα
		log.Fatal(err)
	}

	// Γράψτε μια συμβολοσειρά στο αρχείο
	file.WriteString("Αυτό είναι ένα τυχαίο κείμενο")

	// Κλείστε το αρχείο
	file.Close()
	// == Δεύτερη μέθοδος ανοίγματος αρχείων ==
	// Με την ioutil. συχνά να χρησιμοποιείται σε
	// μεγάλα αρχεία

	// Προσπάθησε να ανοίξεις το αρχείο.
	// Αν δεν το καταφέρεις πρόβαλε το σφάλμα
	stream, err := ioutil.ReadFile("samp.txt")
	if err != nil {
		log.Fatal(err)
	}
	// Μετατρέψτε το περιεχόμενο σε μια συμβολοσειρά
	readString := string(stream)
	fmt.Println(readString)

}
