/*
Καλώς ήρθες

Παραδοχές:
- Έχεις εγκαταστήσει σύμφωνα με τις οδηγίες μας την Go, ένα IDE και φυσικά είναι ρυθμισμένο το σύστημά σου να αντιλαμβάνεται
που είναι η Go (Setup Go Environment)
- Γνωρίζεις Αγγλικά, διότι θα χρησιμοποιούμε κυρίως τους αγγλικούς όρους τις περισσότερες φορές, για να μπορείς να αναζητήσεις
περισσότερες πληροφορίες.

Πρώτον, το αρχείο που άνοιξες είναι κάπου κάτω από το φάκελο src στο χώρο εργασίας μας (go workspace).
Ο φάκελος ονομάζεται 00_package_main. Στη συνέχεια, μέσα του έχουμε το αρχείο που άνοιξες και έχει το ίδιο όνομα
αλλά με την επέκταση/κατάληξη go.

Κάθε αρχείο go αποτελείται σχεδόν πάντα απο 4 στοιχεία:
(1) Package decleration
(2) Imports
(3) Function (main)
(4) Code

Έτσι, το πρώτο πράγμα που χρειάζεται κάθε πρόγραμμα Go είναι μια "package decleration". Εδώ ονομάζεται "main"
Δηλώνοντας το main πακέτο εδώ, λέμε στον compiler (μεταγλωττιστή) να το μεταγλωττίσει ως αυτόνομο εκτελέσιμο πρόγραμμα
και όχι ως μια κοινόχρηστη βιβλιοθήκη (αυτές δεν έχουν main function). Επομένως, κάθε εκτελέσιμο που θέλουμε
να γράψουμε χρειάζεται το main πακέτο ως την πρώτη γραμμή κώδικα.

Το επόμενο πράγμα που χρειαζόμαστε είναι οι import (εισαγωγές) των "Go Standrad Libraries" αλλά και 3ων βιβλιοθηκών. Στην
περίπτωσή μας έχουμε μόνο την "fmt". Τα περισσότερα IDE τα εισάγουν/αφαιρούν αυτόματα με βάση τον κώδικά σας.

Το επόμενο πράγμα που χρειαζόμαστε είναι μια main function (κύρια συνάρτηση).
Έτσι, αυτός ο συνδυασμός "main package" και "func main()" είναι αυτό που ενεργοποιεί, δίνει ζωή και λειτουργεί το πρόγραμμά μας.

Άρα ότι έχουμε μέσα στο main package αρχείο μας είναι το σημείο εισόδου του εκτελέσιμου προγράμματος μας. Φυσικά το προγραμμά μας
μπορεί να μην αποτελείται μόνο απο αυτό το αρχείο αλλά και πάρα πολλά άλλα αρχεία, βιβλιοθήκες κλπ. Στην περίπτωση μας όμως
το πρόγραμμα "package_main"	αποτελείται μόνο απο το "package_main.go" αρχείο.

Όταν εκτελούμε απο το τερματικό το πρόγραμμά μας (θα δείτε παρακάτω πως), αυτό μπαίνει στο main package,
και βρίσκει την main function για να εκτελέσει το Code (κώδικα) που περιλαμβάνει. Για τις functions θα μιλήσουμε εκτενώς
αργότερα οπότε εδώ το πρόγραμμά μας το μόνο που κάνει είναι να λέει το κλασσικό "Γειά σου κόσμε"

*/
package main // (1)

import "fmt" // (2)

func main() { //(3) η κύρια συνάρτηση που εκτελεί την εφαρμογή

	fmt.Println("Γειά σου κόσμε") // (4) εκτελούμε την Println function που βρίσκεται
	// μέσα στην fmt βιβλιοθήκη που εισάγαμε στο (2).
}

/*
Το πρόγραμμα σας, όπως αυτό, μπορείτε να το τρέξετε σε τερματικό γράφοντας

	$ go run package_main.go
	Γειά σου κόσμε

Για να φτιάξετε ένα εκτελέσιμο απο το πρόγραμμά σας και να το μοιραστείτε θα πρέπει να το κάνετε compile (μεταγλώττιση):

	$ go build package_main.go
	$ ls
	package_main    package_main.go

Το παραπάνω θα δημιουργήσει ένα εκτελέσιμο μέσα στον φάκελό σας και μπορείτε να το τρέξετε στο τερματικό

	$ ./package_main
	Γειά σου κόσμε
*/
